pub_subs/app/controllers/sandwiches_controller.rb

INSERT INTO "sandwiches" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "chicken tender"], ["created_at", "2019-10-04 19:38:57.121966"], ["updated_at", "2019-10-04 19:38:57.121966"]]
---
  def create
    @sandwich = Sandwich.new(sandwich_params)

    if @sandwich.save

UPDATE "sandwiches" SET "name" = $1, "updated_at" = $2 WHERE "sandwiches"."id" = $3  [["name", "this"], ["updated_at", "2019-10-10 14:25:54.689890"], ["id", 27]]
---
  def update
    if @sandwich.update(sandwich_params)

DELETE FROM "sandwiches" WHERE "sandwiches"."id" = $1  [["id", 11]]
---
  def destroy
    @sandwich.destroy

SELECT "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sandwich
      @sandwich = Sandwich.find(params[:id])